from aiogram import Router
from aiogram.filters import Command
from aiogram.types import Message

router = Router()


@router.message(Command("help"))
async def help_command(message: Message):
    print("HELP СРАБОТАЛ")

    text = """
📖 <b>Список команд</b>

━━━━━━━━━━━━━━━━━━━━━━

👤 <b>Пользователь</b>

/start — запуск бота
/profile — профиль пользователя
/balance — посмотреть баланс
/reward — получить награду
/pay — передать деньги пользователю
/roulette - рулетка денег
/staff - список модераторов и администраторов
/biz - ваши бизнесы
/buybiz - купить бизнесы
/снятьбиз - снять деньги с баланс бизнеса

━━━━━━━━━━━━━━━━━━━━━━

🏷 <b>Никнеймы</b>

/snick — установить ник
/rnick — удалить ник
/nlist — список всех ников

━━━━━━━━━━━━━━━━━━━━━━

🎖 <b>Роли</b>

/setrole — установить роль

Роли:
• Новый эдитор
• Проверенный эдитор
• Истинный эдитор
• Лучший эдитор
• Великий эдитор

━━━━━━━━━━━━━━━━━━━━━━

🛡 <b>Модерация</b>

от Модератора(2)
/mute — выдать мут
/unmute — снять мут

от Администратора(3)
/ban — выдать бан
/unban — снять бан
/tempban — временный бан
/untempban — снять временный бан
/setmoder - поставить модератора
/rmoder - снять модератора

━━━━━━━━━━━━━━━━━━━━━━

👑 <b>Управление</b>

/setaccess — установить уровень прав
/setadmin - поставить администратора
/radmin - снять администратора

━━━━━━━━━━━━━━━━━━━━━━

ℹ <b>Помощь</b>

/help — открыть это меню
"""

    await message.answer(
        text,
        parse_mode="HTML"
    )